create table students(
	id int,
	name varchar(255),
	class_id varchar(20)
);

insert into students(id,name,class_id,gender) values
	(1,'宋江','水浒',),
	(2,'卢俊义','水浒',),
	(3,'公孙胜','水浒',),
	(4,'吴用','水浒',),
	(5,'公孙胜','水浒',),
	(6,'林冲','水浒',),
	(7,'武松','水浒',),
	(8,'鲁智深','水浒',),
	(9,'唐三藏','西游',),
	(10,'孙悟空','西游',),
	(11,'猪八戒','西游',),
	(12,'沙和尚','西游',),
	(13,'刘备','三国',),
	(14,'关羽','三国',),
	(15,'张飞','三国,'),
	(16,'贾宝玉','红楼'),
	(17,'林黛玉','红楼');
	
create table students_gender (id int, name varchar(20), class_name varchar(20), gender varchar(10));
insert into students_gender (id, name, class_name, gender) values
  (1, '宋江', '水浒', '女'),
  (2, '卢俊义', '水浒', '女'),
  (3, '公孙胜', '水浒', '男'),
  (4, '吴用', '水浒', '保密'),
  (5, '呼延灼', '水浒', '男'),
  (6, '林冲', '水浒', '保密'),
  (7, '武松', '水浒', '保密'),
  (8, '鲁智深', '水浒', '女'),
  (9, '唐三藏', '西游', '男'),
  (10, '孙悟空', '西游', '男'),
  (11, '猪悟能', '西游', '女'),
  (12, '沙悟净', '西游', '男'),
  (13, '刘备', '三国', '女'),
  (14, '关羽', '三国', '女'),
  (15, '张飞', '三国', '女'),
  (16, '贾宝玉', '红楼', '男'),
  (17, '林黛玉', '红楼', '女');
  
 将男用null替换 在输出女的个数
 select count(nullif(gender,'男')) from students_gender;
 
 select stu.id,stu.name,